A hanger cannot be sloped or placed on a sloped element.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FabricationHangerCannotBeSloped { get; }
  Visual Basic
Public Shared ReadOnly Property FabricationHangerCannotBeSloped As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FabricationHangerCannotBeSloped {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPFabricationFailures Class
  Autodesk.Revit.DB Namespace